[
  {
    "name": "Bariatric Surgery and Other Treatments for Clinically Severe Obesity",
    "guideline_number": "CG-SURG-83",
    "description": "Policy for surgical and other treatments for clinically severe obesity, including criteria for medically necessary bariatric surgery, reoperation, revision, and not medically necessary procedures.",
    "raw_text": "Gastric bypass and gastric restrictive procedures are considered medically necessary when all of the following criteria are met: Individual is age 18 years or older; the recommended surgery is one of certain procedures; a BMI of 40 or greater, or 35 or greater with an obesity-related comorbid condition; documentation of weight loss program, prior failed conservative therapy, pre-operative medical & mental health evaluations & education; plus a treatment plan. Reoperations or revisions are medically necessary under certain criteria. Not medically necessary when criteria are not met or for specific non-covered procedures.",
    "restrictions": [
      {
        "condition": "Age ≥ 18",
        "rule": "patient_age >= 18",
        "codes": [],
        "logic": "AND"
      },
      {
        "condition": "Procedure is one of eligible bariatric types",
        "rule": "procedure_code in eligible_bariatric_procedure_codes",
        "codes": [
          "43644",
          "43645",
          "43770",
          "43771",
          "43772",
          "43773",
          "43774",
          "43775",
          "43842",
          "43843",
          "43845",
          "43846",
          "43847",
          "43848",
          "43886",
          "43887",
          "43888"
        ],
        "logic": "AND"
      },
      {
        "condition": "BMI ≥ 40 OR BMI ≥ 35 with comorbidity",
        "rule": "(patient_bmi >= 40) OR (patient_bmi >= 35 AND comorbidity_flag = 1)",
        "codes": [],
        "logic": "AND"
      },
      {
        "condition": "Past participation in a weight loss program",
        "rule": "weight_loss_program_flag = True",
        "codes": [],
        "logic": "AND"
      },
      {
        "condition": "Inadequate weight loss despite conservative medical therapy",
        "rule": "conservative_therapy_flag = True",
        "codes": [],
        "logic": "AND"
      },
      {
        "condition": "Pre-operative medical and mental health evaluations and clearances",
        "rule": "medical_evaluation_flag = True AND mental_health_evaluation_flag = True",
        "codes": [],
        "logic": "AND"
      },
      {
        "condition": "Pre-operative education on risks, benefits, expectations and long-term follow-up",
        "rule": "preoperative_education_flag = True",
        "codes": [],
        "logic": "AND"
      },
      {
        "condition": "Treatment plan addresses pre- and post-operative needs",
        "rule": "treatment_plan_flag = True",
        "codes": [],
        "logic": "AND"
      }
    ]
  }
]